{
  "bosses": [
    {
      "id": 1,
      "name": "King Slime",
      "icon": "./imagens/king-slime.png",
      "order": 1,
      "difficulty": "Pré-Hardmode",
      "description": "Um enorme slime coroado que governa sobre todos os outros slimes. É considerado o chefe mais fácil do jogo e é opcional, mas oferece boas recompensas iniciais.",
      "summon": "Pode aparecer naturalmente nas bordas externas do mapa ou ser invocado usando o item Slime Crown (craftado com 20 gel e 1 gold/platinum crown em um Demon/Crimson Altar).",
      "health": "2.000 / 2.800 (Expert) / 3.570 (Master)",
      "defense": "10",
      "damage": "40 (contato)",
      "tips": "Construa uma plataforma elevada para evitar os slimes menores que ele invoca. Use armas de longo alcance e fique em movimento constante. Arco com flechas flamejantes funciona muito bem.",
      "rewards": "Slime Hook, Slime Gun, Royal Gel, moedas de ouro, e chance de Slime Staff."
    },
    {
      "id": 2,
      "name": "Olho de Cthulhu",
      "icon": "imagens/eye-of-cthulhu-phase-2.png",
      "order": 2,
      "difficulty": "Pré-Hardmode",
      "description": "Um olho demoníaco gigante e o primeiro chefe principal que a maioria dos jogadores enfrenta. Tem duas fases distintas, sendo a segunda muito mais agressiva.",
      "summon": "Aparece naturalmente à noite se o jogador tiver 200+ de vida máxima e 10+ de defesa. Pode ser invocado manualmente usando Suspicious Looking Eye (craftado com 6 Lens em um Demon/Crimson Altar) à noite.",
      "health": "2.800 / 3.640 (Expert) / 4.641 (Master)",
      "defense": "12 (primeira fase) / 0 (segunda fase)",
      "damage": "15-23 (primeira fase) / 30-40 (segunda fase)",
      "tips": "Crie uma arena longa com plataformas em várias alturas. Use armas como Gold Bow ou Demon Bow. Na segunda fase, ele vira uma boca com dentes e fica muito mais rápido - use Hermes Boots e continue se movendo lateralmente.",
      "rewards": "Demonite/Crimtane Ore, Unholy Arrow, Binoculars, e acesso ao Dryad NPC."
    },
    {
      "id": 3,
      "name": "Devorador de Mundos",
      "icon": "imagens/the-eater-of-worlds.png",
      "order": 3,
      "difficulty": "Pré-Hardmode",
      "description": "Um enorme verme segmentado que habita a Corruption. Cada segmento pode ser destruído individualmente, dividindo o chefe em vermes menores. Exclusivo de mundos com Corruption.",
      "summon": "Invocado ao destruir 3 Shadow Orbs na Corruption ou usando Worm Food (craftado com 30 Vile Powder e 15 Rotten Chunk em um Demon Altar) na Corruption.",
      "health": "Varia por segmento - Total aproximado: 7.800 / 10.530 (Expert) / 13.425 (Master)",
      "defense": "2 (cabeça) / 3 (corpo) / 4 (cauda)",
      "damage": "13-22 por segmento",
      "tips": "Armas perfurantes como vilethorn ou jester arrows são excelentes pois atravessam múltiplos segmentos. Crie plataformas em várias alturas e use poções de regeneração. Granadas também são muito efetivas.",
      "rewards": "Demonite Ore, Shadow Scales (para craftar armadura Shadow), e acesso ao Tavernkeep NPC."
    },
    {
      "id": 4,
      "name": "Cérebro de Cthulhu",
      "icon": "imagens/Brain-of-Cthulhu_(Second_Phase).gif",
      "order": 3,
      "difficulty": "Pré-Hardmode",
      "description": "Um cérebro voador protegido por Creepers. É o chefe da Crimson e a alternativa ao Eater of Worlds. Tem duas fases: na primeira está invisível a maior parte do tempo.",
      "summon": "Invocado ao destruir 3 Crimson Hearts na Crimson ou usando Bloody Spine (craftado com 30 Vicious Powder e 15 Vertebrae em um Crimson Altar) na Crimson.",
      "health": "1.250 / 1.700 (Expert) / 2.167 (Master) + Creepers",
      "defense": "14 (primeira fase) / 0 (segunda fase)",
      "damage": "30 (primeira fase) / 40-60 (segunda fase)",
      "tips": "Na primeira fase, foque em eliminar os Creepers primeiro enquanto esquiva do Brain. Na segunda fase, ele se torna visível e faz charges rápidos - construa uma arena aberta com plataformas. Hermes Boots e Shield of Cthulhu são essenciais.",
      "rewards": "Crimtane Ore, Tissue Sample (para craftar armadura Crimson), Brain of Confusion, Bone Rattle."
    },
    {
      "id": 5,
      "name": "imagens/Queen_Bee.gif",
      "icon": "🐝",
      "order": 4,
      "difficulty": "Pré-Hardmode",
      "description": "A rainha das abelhas que governa a colmeia subterrânea na selva. É um chefe opcional mas suas recompensas são muito úteis para a progressão.",
      "summon": "Invocada ao destruir a Larva encontrada em colmeias na selva subterrânea, ou usando Abeemination (craftado com 5 Honey Block, 1 Stinger, 5 Hive e 3 Bottled Honey em qualquer lugar).",
      "health": "3.400 / 4.400 (Expert) / 5.610 (Master)",
      "defense": "8",
      "damage": "30 (contato) / 20 (stinger)",
      "tips": "Lute dentro da colmeia usando as plataformas naturais. Fora da selva, ela fica mais forte. Use armadura de ouro/platina e armas como Flamarang ou Thorn Chakram. Construa plataformas para manobrabilidade vertical.",
      "rewards": "Bee's Knees, Bee Gun, Bee Wax (para craftear bee armor), Hive Wand, Honey Comb, Nectar."
    },
    {
      "id": 6,
      "name": "Skeletron",
      "icon": "imagens/Skeletron.webp",
      "order": 5,
      "difficulty": "Pré-Hardmode",
      "description": "O guardião amaldiçoado da Dungeon. Um esqueleto gigante com mãos separadas que atacam independentemente. Deve ser derrotado para acessar a Dungeon.",
      "summon": "Invocado ao falar com o Old Man na entrada da Dungeon à noite e selecionar 'Curse'. Também pode aparecer durante eventos especiais.",
      "health": "4.400 / 6.600 (Expert) / 8.415 (Master) + mãos",
      "defense": "10 (cabeça) / 14 (mãos)",
      "damage": "20-35 (cabeça) / 40-50 (mãos)",
      "tips": "Destrua ambas as mãos primeiro para facilitar o combate. Sem as mãos, a cabeça perde defesa e aumenta o dano. Use uma longa arena de plataformas e armas como Minishark, Molten Fury ou Water Bolt. CUIDADO: se não derrotá-lo antes do amanhecer, ele mata instantaneamente.",
      "rewards": "Skeletron Hand, Skeletron Mask, Book of Skulls, Chippy's Couch, e libera acesso à Dungeon."
    },
    {
      "id": 7,
      "name": "Parede de Carne",
      "icon": "imagens/Wall_of_Flesh.gif",
      "order": 6,
      "difficulty": "Pré-Hardmode",
      "description": "O último chefe do Pré-Hardmode e guardião do Hardmode. Uma parede gigante de carne com olhos e boca que persegue o jogador através do Underworld. Derrotá-lo ativa o Hardmode.",
      "summon": "Invocado ao jogar um Guide Voodoo Doll na lava do Underworld enquanto o Guide está vivo. Não pode ser invocado novamente após ativar o Hardmode no mesmo mundo.",
      "health": "8.000 / 11.200 (Expert) / 14.280 (Master)",
      "defense": "12",
      "damage": "50-75 (contato)",
      "tips": "Construa uma ponte longa de plataformas através do Underworld (mínimo 1000 blocos). Use Obsidian Skin Potion e armadura Molten. Armas perfurantes como Demon Scythe, Phoenix Blaster ou Hellwing Bow são ideais. Mantenha distância e ataque os olhos.",
      "rewards": "Pwnhammer (necessário para quebrar altares), Breaker Blade, Laser Rifle, Clockwork Assault Rifle, Warrior/Ranger/Sorcerer/Summoner Emblem. ATIVA O HARDMODE."
    },
    {
      "id": 8,
      "name": "Queen Slime",
      "icon": "imagens/Queen_Slime_29.webp",
      "order": 7,
      "difficulty": "Hardmode",
      "description": "Uma versão Hardmode cristalina e gelada do King Slime. Voa pelo ar e invoca slimes alados. É o chefe mais fácil do Hardmode inicial.",
      "summon": "Invocada usando Gelatin Crystal encontrado no Hallow subterrâneo. O item é consumido ao uso.",
      "health": "18.000 / 25.200 (Expert) / 32.130 (Master)",
      "defense": "20",
      "damage": "40-80",
      "tips": "Similar ao King Slime, mas voa e é mais agressiva. Use asas e mantenha-se em movimento vertical. Armas como Daedalus Stormbow com Holy Arrows são muito efetivas. Limpe os slimes menores constantemente.",
      "rewards": "Queen Slime Mount, Crystal Assassin armor set, Gelatinous Pillion, Blade Staff, Sparkle Slime Balloon."
    },
    {
      "id": 9,
      "name": "Os Gêmeos",
      "icon": "imagens/The_Twins.webp",
      "order": 8,
      "difficulty": "Hardmode",
      "description": "Versão Hardmode mecanizada do Eye of Cthulhu. São dois chefes separados: Retinazer (dispara lasers) e Spazmatism (dispara cursed flames). Um dos três Mechanical Bosses.",
      "summon": "Aparece naturalmente à noite após quebrar um Demon/Crimson Altar. Pode ser invocado com Mechanical Eye (craftado com 3 Lens, 5 Iron/Lead Bar, 6 Soul of Light em Mythril/Orichalcum Anvil) à noite.",
      "health": "20.000 cada / 30.000 cada (Expert) / 38.250 cada (Master)",
      "defense": "20 (primeira fase) / 30-35 (segunda fase)",
      "damage": "50-80",
      "tips": "Foque em um de cada vez, geralmente Spazmatism primeiro pois é mais agressivo. Use arena longa com plataformas, asas, e armas como Megashark, Daedalus Stormbow ou Crystal Storm. Poções de buff são essenciais.",
      "rewards": "Hallowed Bars (para craftar equipamento Hallowed), Soul of Sight, Mechanical Lens."
    },
    {
      "id": 10,
      "name": "O Destruidor",
      "icon": "imagens/The_Destroyer.png",
      "order": 8,
      "difficulty": "Hardmode",
      "description": "Versão Hardmode mecanizada do Eater of Worlds. Um verme mecânico gigante que dispara lasers e invoca Probes. Considerado o mais fácil dos três Mechanical Bosses.",
      "summon": "Aparece naturalmente à noite após quebrar um Demon/Crimson Altar. Pode ser invocado com Mechanical Worm (craftado com 6 Rotten Chunk/Vertebrae, 5 Iron/Lead Bar, 6 Soul of Night em Mythril/Orichalcum Anvil) à noite.",
      "health": "80.000 / 120.000 (Expert) / 153.000 (Master) - distribuído entre segmentos",
      "defense": "30 (cabeça) / 35 (corpo) / 40 (cauda)",
      "damage": "50-60 por segmento",
      "tips": "Crie uma arena fechada tipo caixa com teto para limitar movimentação. Use armas perfurantes como Daedalus Stormbow com Holy Arrows, ou Nimbus Rod. Os Probes que invoca podem ser problemáticos - elimine-os quando necessário.",
      "rewards": "Hallowed Bars, Soul of Might, Mechanical Wagon Piece."
    },
    {
      "id": 11,
      "name": "Skeletron Prime",
      "icon": "imagens/Skeletronprimeu.webp",
      "order": 8,
      "difficulty": "Hardmode",
      "description": "Versão Hardmode mecanizada do Skeletron. Possui quatro braços mecânicos diferentes: Prime Cannon, Prime Saw, Prime Vice e Prime Laser. Considerado o mais difícil dos três Mechanical Bosses.",
      "summon": "Aparece naturalmente à noite após quebrar um Demon/Crimson Altar. Pode ser invocado com Mechanical Skull (craftado com 30 Bone, 5 Iron/Lead Bar, 3 Soul of Light, 3 Soul of Night em Mythril/Orichalcum Anvil) à noite.",
      "health": "28.000 / 42.000 (Expert) / 53.550 (Master) + braços",
      "defense": "30 (cabeça) / 43 (braços)",
      "damage": "50-80 (cabeça) / 60-100 (braços)",
      "tips": "Destrua Prime Cannon e Prime Laser primeiro (os que atacam à distância). Use grande mobilidade com asas e armas como Shadowflame Knife, Crystal Storm ou Fetid Baghnakhs. Como Skeletron, se não derrotá-lo antes do amanhecer, ele fica extremamente mortal.",
      "rewards": "Hallowed Bars, Soul of Fright, Mechanical Battery Piece."
    },
    {
      "id": 12,
      "name": "Plantera",
      "icon": "imagens/Plantera_(First_form).gif",
      "order": 9,
      "difficulty": "Pós-Plantera",
      "description": "Um imenso bulbo plantoso que vive nas profundezas da selva subterrânea. É extremamente agressiva e poderosa. Derrotá-la abre a próxima fase do Hardmode.",
      "summon": "Invocada ao destruir o Plantera's Bulb que cresce naturalmente na selva subterrânea após derrotar os três Mechanical Bosses. O bulb aparece lentamente ao longo do tempo.",
      "health": "30.000 / 42.000 (Expert) / 53.550 (Master)",
      "defense": "14 (primeira fase) / 20 (segunda fase)",
      "damage": "50-70 (primeira fase) / 80-120 (segunda fase)",
      "tips": "Prepare uma arena grande e aberta na selva subterrânea. Plantera fica enraged se sair da selva, tornando-se impossível de vencer. Use armas como Megashark com Crystal Bullets, ou Amarok com yoyo bag. Mantenha movimento constante e use heart lanterns/campfires.",
      "rewards": "Temple Key (acessa Lihzahrd Temple), Grenade Launcher, Venus Magnum, Nettle Burst, Wasp Gun, Pygmy Staff, e outros. Desbloqueia Golem e novos itens na Dungeon."
    },
    {
      "id": 13,
      "name": "Golém",
      "icon": "imagens/Golem.png",
      "order": 10,
      "difficulty": "Pós-Plantera",
      "description": "Um golem de pedra antigo que guarda o Lihzahrd Temple. Possui corpo, cabeça e dois punhos separados. Surpreendentemente mais fácil que Plantera.",
      "summon": "Invocado usando Lihzahrd Power Cell no Lihzahrd Altar dentro do Lihzahrd Temple (requer Temple Key de Plantera). Power Cells podem ser encontradas no templo ou dropadas por inimigos lihzahrd.",
      "health": "16.000 (corpo) + 7.000 (cabeça) + 2.500 cada (punho) / 24.000 + 10.500 + 3.750 (Expert) / 30.600 + 13.387 + 4.781 (Master)",
      "defense": "16 (corpo) / 24 (cabeça) / 20 (punhos)",
      "damage": "64-84 (corpo) / 75 (cabeça) / 55-70 (punhos)",
      "tips": "O corpo é estacionário, facilitando o combate. Destrua os punhos primeiro, depois foque na cabeça quando ela se separa. Use plataformas dentro do templo e armas como Terra Blade, Death Sickle ou Heat Ray. É possível teleportá-lo para fora do templo para uma arena melhor.",
      "rewards": "Picksaw, Beetle Husks (para armor), Stynger, Possessed Hatchet, Sun Stone, Eye of the Golem, Golem Fist. Desbloqueia Lunatic Cultist e eventos especiais."
    },
    {
      "id": 14,
      "name": "Duque Fishron",
      "icon": "imagens/Duke_Fishron.webp",
      "order": 11,
      "difficulty": "Pós-Plantera",
      "description": "Um tubarão-porco mutante e um dos chefes mais difíceis do jogo. É tecnicamente opcional mas oferece equipamento de nível superior. Possui três fases com dificuldade crescente.",
      "summon": "Invocado ao pescar no oceano usando Truffle Worm como isca (encontrado no mushroom biome subterrâneo). O worm foge se você se aproximar muito rápido.",
      "health": "50.000 / 60.000 (Expert) / 76.500 (Master)",
      "defense": "50",
      "damage": "60-120 (primeira fase) / 100-140 (segunda fase) / 140-180 (terceira fase enraged)",
      "tips": "Crie uma arena muito longa sobre o oceano com asas e mount. Ele fica enraged na terceira fase ou se sair da água. Use armas end-game como Terra Blade, Chlorophyte Shotbow, Razorpine ou Tsunami. Extreme mobilidade é essencial - use Fishron Mount or UFO Mount se possível.",
      "rewards": "Fishron Wings, Tsunami, Razorblade Typhoon, Tempest Staff, Bubble Gun, Flairon. Equipamento de pré-Lunar Events."
    },
    {
      "id": 15,
      "name": "Imperatriz da Luz",
      "icon": "imagens/Empress_of_Light.gif",
      "order": 11,
      "difficulty": "Pós-Plantera",
      "description": "Uma poderosa imperatriz das fadas que governa o Hallow. Um dos chefes mais desafiadores, especialmente durante o dia onde qualquer hit mata instantaneamente.",
      "summon": "Invocada ao matar um Prismatic Lacewing (borboleta rara que aparece no Hallow à noite após Plantera). Se invocada durante o dia, todos os seus ataques matam em um hit mas aumentam as chances de drops raros.",
      "health": "70.000 / 84.000 (Expert) / 107.100 (Master)",
      "defense": "25 (noite) / 50 (dia)",
      "damage": "70-100 (noite) / 1.000+ (dia - instakill)",
      "tips": "Durante a noite: use asas celestiais, arena aberta e armas rápidas como Chain Gun ou Phantasm. Durante o dia (daytime mode): EXTREME skill - qualquer hit mata, mas requer perfect dodging. Master Ninja Gear e Black Spot mount ajudam.",
      "rewards": "Terraprisma (melhor summon do jogo, noite), Eventide (dia), Empress Wings, Rainbow Whip, Kaleidoscope, Stellar Tune, Rainbow Cursor. Drops garantidos durante dia."
    },
    {
      "id": 16,
      "name": "Cultista Lunático",
      "icon": "imagens/cultist.png",
      "order": 12,
      "difficulty": "Pós-Plantera",
      "description": "O líder de um culto misterioso que adora os Celestial Pillars. Aparece após derrotar Golem. Derrotá-lo inicia os Lunar Events, a fase final do jogo.",
      "summon": "Aparece automaticamente ao matar os quatro Cultist Devotees na entrada da Dungeon após derrotar Golem. Reaparece se passar um dia inteiro sem derrotá-lo.",
      "health": "32.000 / 48.000 (Expert) / 61.200 (Master)",
      "defense": "30",
      "damage": "30-120",
      "tips": "Ele invoca clones - o real é o que não emite partículas. Evite atacar Ancient Doom (orb escuro) pois causa dano massivo. Use armas como Phantasm, Last Prism, ou Meowmere. Foque em DPS alto para minimizar clones.",
      "rewards": "Não dropa itens diretamente. Derrota inicia os Lunar Events, que levam ao Moon Lord."
    },
    {
      "id": 17,
      "name": "Moon Lord, O Senhor da Lua",
      "icon": "imagens/Moon_Lord.webp",
      "order": 13,
      "difficulty": "Pós-Plantera",
      "description": "O chefe final do Terraria e irmão de Cthulhu. Um ser cósmico colossal com partes corporais independentes. O desafio definitivo do jogo.",
      "summon": "Aparece automaticamente após derrotar os quatro Celestial Pillars durante os Lunar Events. Também pode ser invocado manualmente usando Celestial Sigil (craftado com 20 fragments de cada tipo).",
      "health": "145.000 total: olhos (23.000 cada), mãos (25.000 cada), core (45.000) / Expert e Master tem multiplicadores maiores",
      "defense": "50 (partes) / 100 (core)",
      "damage": "100-300+",
      "tips": "Crie arena longa com heart lanterns, campfires, e honey pools. Destrua ambos os olhos da tela e mãos primeiro para expor o core. Use armas end-game como Solar Eruption, Daybreak, Last Prism, ou Phantasm com armor celestial. Nurse próxima pode salvar vidas. Phantasmal Deathray é mortal - evite a todo custo.",
      "rewards": "Meowmere, Star Wrath, Terrarian, Last Prism, Lunar Flare, Rainbow Crystal Staff, Lunar Portal Staff, Celebration Mk2, e outros end-game items. Boss Bag contém Gravity Globe, Suspicious Looking Tentacle, Celestial Starboard."
    }
  ]

}


